### Student performance data

A sample dataset was created to demonstrate Pandas CSV reading and basic analysis techniques.

In [7]:
# Import Libraries
import pandas as pd

In [9]:
# Create a Sample Dataset 
data = {
    "Student_ID": [101, 102, 103, 104, 105],
    "Name": ["Ayo", "Bola", "Chidi", "Dami", "Efe"],
    "Score": [78, 85, 62, 90, 70],
    "Age": [15, 16, 15, 17, 16]
}

df = pd.DataFrame(data)
df

   Student_ID   Name  Score  Age
0         101    Ayo     78   15
1         102   Bola     85   16
2         103  Chidi     62   15
3         104   Dami     90   17
4         105    Efe     70   16

In [11]:
# Save Dataset to CSV 
df.to_csv("students.csv", index=False)

In [13]:
# Read CSV into DataFrame 
students_df = pd.read_csv("students.csv")
students_df

   Student_ID   Name  Score  Age
0         101    Ayo     78   15
1         102   Bola     85   16
2         103  Chidi     62   15
3         104   Dami     90   17
4         105    Efe     70   16

In [17]:
# Inspect Data
students_df.head()

   Student_ID   Name  Score  Age
0         101    Ayo     78   15
1         102   Bola     85   16
2         103  Chidi     62   15
3         104   Dami     90   17
4         105    Efe     70   16

In [19]:
students_df.tail()

   Student_ID   Name  Score  Age
0         101    Ayo     78   15
1         102   Bola     85   16
2         103  Chidi     62   15
3         104   Dami     90   17
4         105    Efe     70   16

In [21]:
students_df.dtypes

Student_ID     int64
Name          object
Score          int64
Age            int64
dtype: object

In [29]:
# Summary Statistics 
students_df.describe()

       Student_ID      Score       Age
count    5.000000   5.000000   5.00000
mean   103.000000  77.000000  15.80000
std      1.581139  11.269428   0.83666
min    101.000000  62.000000  15.00000
25%    102.000000  70.000000  15.00000
50%    103.000000  78.000000  16.00000
75%    104.000000  85.000000  16.00000
max    105.000000  90.000000  17.00000

In [25]:
print(students_df["Score"].mean())
print(students_df["Score"].median())
print(students_df["Score"].min())
print(students_df["Score"].max())
print(students_df["Score"].count()

77.0
78.0
62
90
5

In [31]:
# Filter Rows
high_scores = students_df[students_df["Score"] > 75]
high_scores

   Student_ID  Name  Score  Age
0         101   Ayo     78   15
1         102  Bola     85   16
3         104  Dami     90   17

In [33]:
# Select Columns
name_and_score = students_df[["Name", "Score"]]
name_and_score

    Name  Score
0    Ayo     78
1   Bola     85
2  Chidi     62
3   Dami     90
4    Efe     70

In [35]:
# Slice Subsets
students_df.iloc[0:3]

   Student_ID   Name  Score  Age
0         101    Ayo     78   15
1         102   Bola     85   16
2         103  Chidi     62   15

In [37]:
# Save Filtered Results 
high_scores.to_csv("high_scoring_students.csv", index=False)